import React from "react";
import type { Metadata } from "next";

export const metadata: Metadata = {
  title: "ລາວລາວ | ຄວາມຮູ້ເພີ່ມເຕີມ",
  description: "ວັດຈະນານຸກົມ, ພາສາລາວ, ຄຳສັບລາວ, ລາວ, ຄວາມຫມາຍພາສາລາວ",
};

export default function page() {
  return (
    <main className="">
      <div className="flex flex-col h-auto p-4 bg-white">
        <div className="container max-w-4xl mx-auto flex-grow">
          <h1 className="text-3xl font-bold mb-6 text-center text-primaryBg">
            ຫລັກການໃຊ້ວັດຈະນານຸກົມ
          </h1>
          <hr className="border border-primaryAccent" />
          <section className="my-8 ">
            <h2 className="text-xl font-semibold mb-4 ">ກ. ການຮຽງລຳດັບ</h2>
            <h3 className="text-lg font-semibold mb-4">
              1. ພະຍັນຊະນະຮຽງໄວ້ຕາມລຳດັບຕົວອັກສອນ ດັ່ງນີ້:
            </h3>
            <p className="text-base pl-10 ">
              ກ ຂ ຄ ງ ຈ ສ ຊ ຍ ດ ຕ ຖ ທ ນ ບ ປ ຜ ຝ ພ ຟ ມ ຢ ລ ວ ຫ ຫງ ຫຍ ໜ ໝ ຫຼ ຫວ ອ
              ຮ.
            </p>
            <p>
              ( ຣ: ໃຊ້ຂຽນຄຳສັບທີ່ຢືມມາຈາກພາສາຕ່າງປະເທດ ເຊັ່ນ: ຮົງກາຣີ, ປາຣີ,
              ໂປຣຕີນ...)
            </p>
            <h3 className="text-lg font-semibold mt-4">
              2. ສະຫຼະທີ່ປະສົມກັບພະຍັນຊະນະ ຮຽງໄວ້ຕາມລຳດັບສະຫຼະດັ່ງນີ້:
            </h3>
            <p className="font-phetsarath text-lg pl-10 tracking-widest mt-4">
              xະ xາ xິ xີ xຶ xື xຸ xູ ເxະ ເx ແxະ ແx ໂxະ ໂx ເxາະ xໍ ເxິ ເxີ ເxັຍ
              ເxຍ ເxຶອ ເxືອ xົວະ xົວ ໄx ໃx ເxົາ xຳ.
            </p>
            <h3 className="text-lg  mt-4">
              3. ຄຳທີ່ບໍ່ມີຕົວສະກົດ ຮຽງໄວ້ກ່ອນຄຳທີ່ມິຕົວສະກົດ
              ໂດຍຈັດໃຫ້ໄປຕາມລຳດັບສະຫຼະ ທີ່ຂໍ້2, ສ່ວນຄຳທີ່ມີຕົວສະກົດນັ້ນ
              ຮຽງໄວ້ຕາມລຳດັບຕົວສະກົດ.
            </h3>
            <p className="font-phetsarath text-lg mt-4">
              4. ຄຳທີ່ມີຕົວສະກົດ ຫຼື ພະຍາງທີ່ມີຕົວສະກົດນັ້ນ
              ຕົວສະກົດຮຽງໄປຕາມລຳດັບພະຍັນຊະນະທີ່ໃຊ້ເປັນຕົວສະກົດ ເຊິ່ງຢູ່ກ່ອນ ແລະ
              ລຸນ ດັ່ງນີ້: ກ ງ ຍ ດ ນ ບ ມ ວ.
              ໃນນີ້ຕົວສະກົດຕົວໃດກໍຮຽງລຳດັບໄປຈົນສຸດສະຫຼະ ຕັ້ງແຕ່ xັ (ສະຫຼະ xະ)
              ໄປຈົນເຖິງ xົວ (ວ) ຍົກເວັ້ນແຕ່ສະຫຼະ ໄx ໃx ເxົາ xຳ
              ເຊິ່ງໃຊ້ສະກົດບໍ່ໄດ້.
            </p>
            <p className="text-lg mt-4">
              5. ຄໍາຈໍາພວກພະຍັນຊະນະປະສົມ ເຊັ່ນ: ຫງ ຫຍ ໜ ໝ ຫູ ຫວ
              ຮຽງໄວ້ຕາມລໍາດັບຕໍ່ຈາກຄໍາຈໍາພວກ ອັກສອນສູງ ຄື ຄໍາທີ່ຂຶ້ນຕົ້ນດ້ວຍຕົວ
              ຫ. ສ່ວນຄໍາທີ່ເປັນຈຳພວກພະຍັນຊະນະຄວບນັ້ນ ຮຽງໄວ້ ຕາມລໍາດັບພະຍັນຊະນະ,
              ສະຫຼະ ແລະ ຕົວສະກົດ ຕົວຢ່າງ ຄໍາວ່າ ກວານ, ກວານເຂົ້າຈໍ້າ, ກວ້ານ
              ຮຽງໄວ້ຕໍ່ຈາກ ຄໍາວ່າກ້ວນ ເປັນຕົ້ນ.
            </p>
            <p className="text-lg mt-4">
              6. ຄໍາສັບທີ່ມີເຄົ້າມູນອັນດຽວກັນ ແຕ່ໃຊ້ພ້ຽນໄດ້ຫຼາຍຢ່າງ ເຊັ່ນ:
              ຫິມະວັນ. ຫິມະວານ, ຫິມະພານ, ໄດ້ແປໄວ້ແຕ່ສັບເດີມ
              ສ່ວນຄໍາພ້ຽນໄປນັ້ນບໍ່ໄດ້ແປ ແຕ່ໄດ້ບອກໃຫ້ເບິ່ງຄໍາແປໃນສັບເດີມ.
            </p>
            <p className="text-lg mt-4">
              7. ຄໍາທີ່ມີຮູບສັບຢ່າງດຽວກັນ ແຕ່ມີຄວາມໝາຍໄດ້ຫຼາຍຢ່າງ ດັ່ງຄໍາວ່າ ຮັບ
              ໄດ້ຂຽນເລກກຳກັບໄວ້ວ່າ ຮັບ 1 ຮັບ 2 ແລ້ວອະທິບາຍຄວາມໝາຍຂອງຄໍານັ້ນໆໄວ້.
            </p>
            <h3 className="text-lg font-semibold mt-4">
              8. ຄໍາທີ່ນິຍົມໃຊ້ໃນກາບກອນ ໂຄງສານ ສ່ວນຫຼາຍມັກມີຄໍາປະເພດດັ່ງຕໍ່ໄປນີ້
              :
            </h3>
            <p className="text-base pl-10 mt-4">
              ກ. ຄໍາທີ່ຕື່ມ ອາ ອີ ໂອ ອິນ ຂ້າງທ້າຍ ເຊັ່ນ: ກາຍາ, ກາໂຍ, ກາຍີ,
              ກາຍິນ. <br />
              ຂ. ຄໍາທີ່ຕື່ມ ເxດ ຂ້າງທ້າຍ ເຊັ່ນ: ນະຄະເລດ, ພູເບດ, ມະຍຸເລດ. <br />
              ຄ. ຄໍາທີ່ຕື່ມ ອາການ ຂ້າງທ້າຍເຊັ່ນ: ທັດສະນາການ, ຈິນຕະນາການ,
              ຄະນະກຳມະການ. <br />
              ງ. ຄໍາທີ່ຕື່ມ ຊາດ ຂ້າງທ້າຍ ເຊັ່ນ: ບຸບຜາຊາດ, ສຸຄັນທະຊາດ, ພຶກສາຊາດ.
            </p>
            <p className="text-base mt-4">
              ຄໍາທັງຫຼາຍທີ່ຍົກມາອ້າງ ເປັນຕົວຢ່າງຂ້າງເທິງນີ້
              ມີຄວາມໝາຍບໍ່ຕ່າງຈາກຄໍາເດີມເຊິ່ງໄດ້ເອົາບັນຈຸໄວ້ໃນ
              ວັດຈະນານຸກົມນີ້ແລ້ວ. ດັ່ງນັ້ນ ຖ້າຫາກບໍ່ເຫັນຮູບສັບນັ້ນໆ
              ກໍໃຫ້ຊອກເບິ່ງຄໍາເດີມ ເຊັ່ນ: ກາຍາ, ກາຍີ, ກາຍິນ ໃຫ້ເບິ່ງຄໍາ ກາຍ
              ແລ້ວກໍຈະຮູ້ຄວາມໝາຍທັນທີ ໂລດເພາະວ່າມັນມີຄວາມໝາຍອັນດຽວກັນ.
            </p>
          </section>

          <section className="mb-8">
            <h2 className="text-xl font-semibold mb-4">ຂ. ປະຫວັດຂອງຄຳ</h2>
            <p className="text-lg mb-4">
              1. ຄໍາທີ່ໄດ້ເຄົ້າມາຈາກພາສາອື່ນ ໄດ້ບອກຊື່ພາສານັ້ນໆໄວ້ຂ້າງສັບນັ້ນໂລດ
              ເຊິ່ງອະທິບາຍດ້ວຍອັກສອນຫຍໍ້ ໃນວົງເລັບ ເຊັ່ນ: (ປ.) ໝາຍຄວາມວ່າ ປາລີ,
              (ສ.) ໝາຍຄວາມວ່າສັນສະກິດ, (ປ. ສ.) ໝາຍຄວາມວ່າ ປາລີ ແລະ ສັນສະກິດ,
              (ຝ.) ໝາຍຄວາມວ່າຝຣັ່ງ.
            </p>
            <p className="text-lg mb-4">
              2. ຄໍາລາວເດີມ ຫຼື ຄໍາລາວແທ້ ແລະ ຄໍາທີ່ບໍ່ຮູ້ຄັກແນ່ວ່າ ມາແຕ່ພາສາໃດ
              ບໍ່ໄດ້ບອກແຫຼ່ງທີ່ມາໄວ້ນໍາ.
            </p>
            <p className="text-lg mb-4">
              3. ໜັງສືວັນນະຄະດີທີ່ເອົາມາອ້າງອີງ ຫຼື ທີ່ຖອດອອກມາເປັນຕົວຢ່າງ
              ໄດ້ບອກຊື່ເລື່ອງວັນນະຄະດີນັ້ນໆ ໄວ້ດ້ວຍ.
            </p>
            <p className="text-lg mb-4">
              4. ຄໍາໃນວົງເລັບທ້າຍ ຕົວຢ່າງທີ່ຍົກມາ ບອກຫຼັກຖານທີ່ອ້າງອີງ
              ເຊິ່ງມີຊື່ເຕັມດັ່ງນີ້ ຄື:
            </p>
            <div className="grid sm:grid-cols-2 grid-cols-1 pl-10">
              <ul className="list-disc text-base">
                <li>(ກາ) = ກາລະເກດ</li>
                <li>(ກາໄກ) = ທ້າວກາໄກ</li>
                <li>(ກາເຜືອກ) = ທ້າວກາເຜືອກ</li>
                <li>(ຂຸນທຶງ) = ທ້າວຂຸນທຶງຂຸນເທືອງ</li>
                <li>(ຂຸນບູລົມ) = ພື້ນຂຸນບູລົມ</li>
                <li>(ຂຸລຸ) = ຂຸລຸນາງອົ້ວ</li>
                <li>(ຄໍາສອນ) = ທ້າວຄໍາສອນ</li>
                <li>(ສຸດ) = ສຸດທີ່ອ່າວ</li>
                <li>(ສິນ) = ສິນໄຊ</li>
                <li>(ສົມ) = ສົມທີ່ຄຶດ</li>
                <li>(ສຽວ) = ສຽວສະຫວາດ</li>
                <li> (ຍ່າ) = ຍ່າສອນຫຼານ</li>
                <li>(ບ) = ບູຮານ</li>
                <li>(ປະເພນີ) = ປະເພນີລາວບູຮານ</li>
              </ul>
              <ul className="list-disc">
                <li>(ປັດເສນ) = ພະຍາປັດເສນ</li>
                <li>(ປູ່) = ປູ່ສອນຫຼານ</li>
                <li>(ຜະຫຍາ) ຄໍາຜະຫຍາ</li>
                <li>(ຜາແດງ) = ຜາແດງນາງໄອ່</li>
                <li>(ພາສິດ) = ພາສິດບູຮານລາວ</li>
                <li>(ລິນ) = ທ້າວລິນທອງ</li>
                <li>(ລຶບ) = ສານລຶບພະສູນ</li>
                <li>(ເວດ) = ເວດສັນດອນ</li>
                <li>(ອິນ) = ອິນທິຍານສອນລູກ</li>
                <li>(ໜ້າຜາກ) = ໜ້າຜາກໄກກະຕົ້ນ</li>
                <li>(ຮຸ່ງ) = ທ້າວຮຸ່ງທ້າວເຈືອງ</li>
              </ul>
            </div>
          </section>

          <section>
            <h2 className="text-xl font-semibold mb-4">
              ຄ. ອັກສອນຫຍໍ້ທີ່ໃຊ້ໃນວັດຈະນານຸກົມ
            </h2>
            <h3 className="text-lg font-semibold mb-4">
              1. ອັກສອນຫຍໍ້ຢູ່ນອກວົງເລັບ ເຊິ່ງຮຽງໄວ້ຕໍ່ຈາກຄຳແຕ່ລະຄຳນັ້ນ
              ແມ່ນໃຊ້ບອກປະເພດຂອງຄຳ ຕາມຫລັກໄວຍາກອນຄື:
            </h3>
            <ul className="list-disc pl-10">
              <li>ກ. ກິລິຍາ = ຄຳກຳມະ</li>
              <li>ສ. ສັບພະນາມ ຄໍາແທນນາມ, ຄໍາແທນຊື່</li>
              <li>ສັນ. ສັນທານ = ຄໍາຕໍ່, ຄໍາເຊື່ອມຄໍາ</li>
              <li>ນ. ນາມ = ບອກຊື່, ຄໍານາມ</li>
              <li>ບ. ບຸບພະບົດ = ຄໍານໍາໜ້ານາມ</li>
              <li>ວ. ວິເສດ = ຄໍາຄຸນນາມ, ຄໍາຂະຫຍາຍກຳມະ ຫຼື ຄໍາກິລິຍາ</li>
              <li>ອຸ. ອຸທານ = ຄໍາອຸທານ</li>
            </ul>
            <h3 className="text-lg font-semibold my-4">
              2. ອັກສອນຫຍໍ້ໃນວົງເລັບ ເຊິ່ງຮຽງໄວ້
              ຕໍ່ຈາກອັກສອນຫຍໍ້ບອກປະເພດຂອງຄໍານັ້ນແມ່ນໃຊ້ສໍາລັບບອກທີ່ ມາຂອງຄໍາ
              ດັ່ງນີ້:
            </h3>
            <ul className="text-base pl-10 list-disc">
              <li>(ຂ.) ຂະເໝນ</li>
              <li>(ຈ.) = ຈີນ</li>
              <li>(ສ.) = ສັນສະກິດ</li>
              <li>(ທ.) = ໄທ</li>
              <li>(ປ.) ປາລີ</li>
              <li>(ຝ.) = ຝຣັ່ງ</li>
              <li>(ຫວ.) = ຫວຽດນາມ</li>
              <li>(ອ.) = ອັງກິດ</li>
              <li>(ຮ.) = ຮິນດູ</li>
            </ul>
          </section>
        </div>
      </div>
    </main>
  );
}
