/* eslint-disable react/no-unescaped-entities */
import Image from "next/image";
import React from "react";
import BookPic from "../../../public/lao_dictionary_book.png";
import type { Metadata } from "next";

export const metadata: Metadata = {
  title: "ລາວລາວ | ຂໍ້ມູນອ້າງອີງ",
  description: "ຂໍ້ມູນອ້າງອີງ, ຄຳສັບລາວ, ວັດຈະນານຸກົມພາສາລາວ",
};

function Reference() {
  return (
    <main className="flex flex-col h-auto p-4 bg-white">
      <div className="container max-w-4xl mx-auto flex-grow">
        <h1 className="text-3xl font-bold mb-6 text-center text-primaryBg">
          ຂໍ້ມູນອ້າງອີງ
        </h1>
        <hr className="border border-primaryAccent mb-4" />
        <p className="text-center">
          ຂໍ້ມູນທີ່ເອົາມາສະແດງເທິງຫນ້າເວບແອັບນີ້ໄດ້ອ້າງອີງມາຈາກ ປຶ້ມ "
          ວັດຈະນານຸກົມ ພາສາລາວ " ສະບັບປັບປຸງໃຫມ່ 2022,
          <br /> ເຊິ່ງໄດຄົ້ນຄວ້າ ແລະ ຮຽບຮຽງໂດຍ: ປອ ທອງຄຳ ອ່ອນມະນີສອນ
          <br />
          ປື້ມຫົວນີ້ໄດ້ຜ່ານການຮັບຮອງໂດຍ ສະຖາບັນຄົ້ນຄວ້າວິທະຍາສາດສຶກສາ(ສວສ)
          ແລະຈັດພິມໂດຍ{" "}
          <a
            href="https://www.pankham.com/?lang=lo"
            target="_blank"
            className=" underline underline-offset-2 hover:text-blue-800 hover:underline"
          >
            ບໍລິສັດ​ ປານຄຳຈຳປາ ຈຳກັດ
          </a>
        </p>
        <div className="flex justify-center mt-5 ">
          <Image
            className="rounded-md"
            src={BookPic}
            width={250}
            height={250}
            alt="ປຶ້ມວັດຈະນານຸກົມ ພາສາລາວ"
          />
        </div>

        <section className="my-8">
          <p className="text-justify">
            ຂ້າພະເຈົ້າ ຂໍເວົ້າດ້ວຍຄວາມຈິງໃຈວ່າ ຜົນສຳເລັດຂອງການຄົ້ນຄວ້າຮຽບຮຽງ
            ວັດຈະນານຸກົມພາສາລາວ ສະບັບນີ້ ແມ່ນເກີດມາຈາກການເລືອກເຟັ້ນ ແລະ
            ປະດິດຄິດສ້າງ ບົນຟື້ນຖານແຫຼ່ງຂໍ້ມູນຕ່າງໆ ທີ່ເປັນຜົນງານ
            ຂອງນັກປາດອາຈານຜູ້ປີຊາສາມາດ ສະຫລາດສ່ອງໃສ
            ນັບແຕ່ສະໄໝອານາຈັກລ້ານຊ້າງເປັນຕົ້ນມາ ຈົນຮອດຍຸກສະໄໝລະບບໃໝ່
            ຄືລະບອບປະຊາທິປະໄຕປະຊາຊົນ ໃນທຸກມື້ນີ້
            ລວມທັງວັດຈະນານຸກົມຕ່າງປະເທດອື່ນໆ ເຊິ່ງຂ້າພະເຈົ້າຮູ້ສຶກເປັນໜີ້ບຸນຄຸນ
            ແລະ ຂໍຈາລຶກມໍລະດົກທາງພູມປັນຍາອັນປະເສີດດັ່ງກ່າວນັ້ນ ໄວ້ໃນປຶ້ມ
            ວັດຈະນານຸກົມສະບັບນີ້ຕະຫຼອດການ. ແຫຼ່ງຂໍ້ມູນທີ່ສຳຄັນມີດັ່ງຕໍ່ໄປນີ້:
          </p>
          <div className="flex flex-col my-8 space-y-5">
            <div className="grid grid-cols-1 md:grid-cols-2 gap-4">
              <div>1. ໄວຍາກອນລາວ ໂດຍ:</div>
              <div>
                <p>ພູມີ ວົງວິຈິດ</p>
                <p>ພະແນກສຶກສາສູນກາງພິມຈຳໜ່າຍ, ຊຳເໜືອ, 1967</p>
              </div>
              <div>2. ວັດຈະນານຸກົມພາສາລາວ</div>
              <div>
                <p>ສະບັບກະຊວງສຶກສາ, ພິມຄັ້ງທີສອງ</p>
                <p>ລິດຈະນາໂດຍ: ມະຫາສິລາ ວິຣະວົງ</p>
                <p>ວຽງຈັນ, 13ມັງກອນ 1960</p>
              </div>
              <div>3. Dictionaire Laotien-française Tome I-II</div>
              <div>
                <p>par Marc REINHORN</p>
                <p>Centre Nationale de la Recherche</p>
                <p>Scientifique, Paris 1970</p>
              </div>
              <div>4. Lao-English Dictionary volume I-II</div>
              <div>
                <p>by Allen D. Kerr</p>
                <p>the Catholic University of America Press</p>
                <p>Washington, D. C. 1972</p>
              </div>
              <div>5. ສາລານຸກົມ ພາສາ ອີສານ - ໄທ - ອັງກິດ</div>
              <div>
                <p>ໂດຍ: ປີຊາ ພິນທອງ</p>
                <p>ໂຮງພິມ ສິລິທຳ, ອຸບົນລາຊະທານີ 1989</p>
              </div>
              <div>6. ພົດຈະນານຸກົມ (ພາສາໄທ) ສະບັບລາຊະບັນດິດຕະຍະສະຖານ</div>
              <div>
                <p>ພ.ສ. 2525 ບາງກອກ, ປະເທດໄທ.</p>
              </div>
            </div>

            <p className="text-justify">
              7. ໜັງສືຜູກໃບລານ, ປຶ້ມວັນນະກຳບູຮານລາວ, ປຶ້ມວັນນະຄະດີລາວສະໄໝໃໝ່,
              ວາລະສານ, ໜັງສືພິມ, ເອກະສານຕ່າງໆ
              ລວມທັງຂໍ້ມູນທີ່ເກັບກຳໄດ້ຈາກການສົນທະນາແລກປ່ຽນຄວາມຄິດເຫັນ,
              ການປຶກສາຫລື ແລະ ສຳພາດປະຊາຊົນ ແລະ ຜູ້ຊົງຄຸນວຸດທິ
              ທີ່ມີຄວາມຮູ້ຢ່າງກ້ວາງຂວາງ ທາງດ້ານພາສາລາວ.
            </p>
          </div>
        </section>

        <section className="my-8">
          <p className="text-justify my-4">
            ໃນນາມຂອງຜູ້ຄົ້ນຄ້ວາຮຽບຮຽງ ວັດຈະນານຸກົມພາສາລາວເຫຼັ້ມນີ້
            ຂ້າພະເຈົ້າຂໍສະແດງຄວາມຮູ້ບຸນຄຸນ ຢ່າງສູງ ແລະ ຂໍຂອບໃຈຢ່າງເລິກເຊິ່ງ
            ມາຍັງ ມູນນິທິໂຕໂຍຕ້າ ປະເທດຍີ່ປຸ່ນທີ່ໄດ້ໃຫ້ທຶນຊ່ວຍເຫຼືອ ໂດຍສະເພາະ
            ຢ່າງຍິ່ງ ຂໍຂອບໃຈຢ່າງລົ້ນເຫຼືອມາຍັງ ທ່ານ ໂຕອິຈິ ມະກິຕະ
            ຫົວໜ້າພະແນກສຳພັນຕ່າງປະເທດ ຂອງມູນນິທິ ໂຕໂຍຕ້າ
            ທີ່ຮັບຜິດຊອບກ່ຽວກັບການໃຫ້ທຶນສະໜັບສະໜູນການຄົ້ນຄ້ວາທາງດ້ານວັດທະນະທຳ
            ແກ່ ສປປ ລາວ ແລະ ນາງ ຢູມິໂກະ ຮິເມະໂມະໂຕະ ຜູ້ຊ່ວຍພະແນກສຳພັນຕ່າງປະເທດ
            ຂອງມູນນິທິດັ່ງກ່າວ ເຊິ່ງທັງສອງ
            ທ່ານນີ້ໄດ້ເປັນຜູ້ສະໜັບສະໜູນການລີເລີ່ມໂຄງການແຕ່ເບື້ອງຕົ້ນ
            ຈົນບັນລູຜົນສຳເລັດຢ່າງສະຫງ່າງາມ ໃນ ຂັ້ນສຸດທ້າຍ,
            ຂໍບັນດາທ່ານທີ່ອ້າງມາຂ້າງເທິງນີ້ ພ້ອມດ້ວຍມູນນິທິໂຕໂຍຕ້າ
            ຈົ່ງປະສົບຜົນສຳເລັດອັນໃຫຍ່ຫຼວງ ໃນໜ້າທີ່ວຽກງານ, ມີຄວາມສຸກ ຄວາມຈະເລີນ
            ແລະ ກ້າວໜ້າຮຸ່ງເຮືອງຕະຫຼອດໄປ.
          </p>
          <p className="text-justify my-8">
            ພ້ອມທັງນີ້ ກໍຂໍສະແດງຄວາມຮູ້ບຸນຄຸນ ແລະ ຂໍຂອບໃຈຢ່າງເລິກເຊິ່ງ
            ມາຍັງບັນດາທ່ານເພື່ອນຮ່ວມງານ ເຊິ່ງຂ້າພະເຈົ້າຮູ້ສຶກເປັນ ຕົ້ນແມ່ນ
            ທ່ານອາຈານບຸນຍົກ ແສນສູນທອນ ທີ່ໄດ້ເສຍສະຫຼະເຫື່ອແຮງສະຕິປັນຍາ
            ໃຫ້ຄວາມຮ່ວມມື ແລະ ປະກອບສ່ວນຢ່າງຈິງໃຈ
            ໃນການເກັບຂໍ້ມູນເພື່ອສ້າງໃຫ້ວັດຈະນານຸມກົມພາສາລາວສະບັບນີ້
            ເກີດຂຶ້ນເປັນຕົວຈິງ ຮັບໃຊ້ສັງຄົມລາວຕໍ່ໄປ.
          </p>

          <p className="text-justify my-8">
            ຫາກບຸນກຸສົນໃດທີ່ຈະເກີດຈະມີຈາກ ວັດຈະນານຸກົມລາວສະບັບນີ້
            ຂ້າພະເຈົ້າຂໍອຸທິດສ່ວນກຸສົນນັ້ນ ແກ່ ບິດາ ມານດາ ແລະ ບຸບພາຈານ
            ຜູ້ມີພະຄຸນທູກທ່ານ ໄວ້ນະໂອກາດນີ້ດ້ວຍ.
          </p>

          <div className="flex justify-end text-end">
            <p>
              ວຽງຈັນ, ວັນທີ1 ເດືອນ ມິຖຸນາ ປີ ຄສ 1992 <br />
              ປອ. ທອງຄຳ ອ່ອນມະນີສອນ
            </p>
          </div>
        </section>
        <section className="flex justify-center space-x-10 my-8 text-2xl">
          <h1>🧾</h1>
          <div className="">
            <ul className="">
              <li>ປູກລູກ</li>
              <li>ປູກພິບໄຫວ</li>
              <li>ປູກດົງປ່າ</li>
              <li>ປູກສິນພາສາ</li>
            </ul>
          </div>
          <div>
            <ul>
              <li>ປູກທີ່ໃຈ</li>
              <li>ປູກປັນຍາ</li>
              <li>ປູກຟ້າດິນ</li>
              <li>ພາຊາດສີວິໄລ</li>
            </ul>
          </div>
        </section>
        <h1 className="text-end text-lg text-primaryBg my-8">
          ✍️ ປອ. ທອງຄຳ ອ່ອນມະນີສອນ
        </h1>

        <section className="my-16 text-center">
          <div className="text-2xl ">
            <p>
              ອ່ານຫນັງສືແມ່ນຮັກຊາດ
              <br />
              ຄົນສະຫລາດແມ່ນອ່ານປຶ້ມຫຼາຍ <br />
              ຢາກຊາບຊຶມຢ່າງເລິກເຊິ່ງພາສາລາວ <br />
              ຕ້ອງໃຊ້ປຶ້ມວັດຈະນານຸກົມ ( ຫລາຍໆຫົວ ) <br />
              ຈະພາໃຫ້ຮູ້ແຫຼ່ງຂໍ້ມູນ ແລະ ການນຳໃຊ້ພາສາທີ່ຖືກຕ້ອງ
            </p>
          </div>

          <div className="my-16">
            <p className="text-2xl">
              ໂຄງການສົ່ງເສິມການອ່ານແຫ່ງຊາດ <br />
              ຂໍເຊີນຊວນບັນດາທ່ານທັງຫຼາຍພ້ອມດ້ວຍສາຖາບັນຕ່າງໆ <br />
              ສະໜັບສະໜູນມີໄວ້ເປັນສົມບັດ ເພື່ອພັດທະນາພາສາລາວ
            </p>
          </div>
          <h1 className="text-primaryBg text-end text-lg">
            ອ.ຈ ກົງເດືອນ ເນດຕາວົງ
          </h1>
        </section>
      </div>
    </main>
  );
}

export default Reference;
